      *----------------------------------------------------------------*
      * TAMANHO DE CARACTERES 46                                   *
      *----------------------------------------------------------------*
       01  REG-CLIENTE-A
           05  CPF-A                      PIC X(11).             
           05  NOME-A                     PIC X(20).                   
           05  AGENCIA-A                  PIC X(11).         
           05  SALDO-A                    PIC S9(05)V99 COMP-3.
       