      *----------------------------------------------------------------*
      * TAMANHO DE CARACTERES 46                                   *
      *----------------------------------------------------------------*
       01  REG-CLIENTE-E
           05  CPF                      PIC X(11).             
           05  NOME                     PIC X(20).                   
           05  AGENCIA                  PIC X(11).         
           05  SALDO                    PIC S9(05)V99 COMP-3.
        