      *----------------------------------------------------------------*
      * TAMANHO DE CARACTERES 46                                   *
      *----------------------------------------------------------------*
       01  REG-CLIENTE-D
           05  CPF-D                      PIC X(11).             
           05  NOME-D                     PIC X(20).                   
           05  AGENCIA-D                  PIC X(11).         
           05  SALDO-D                    PIC S9(05)V99 COMP-3.