       01  REG-EXTTDESO.                                                00020001
           05 CPF-DESO                     PIC X(11).                   00030001
           05 NOME-DESO                    PIC X(16).                   00040001
           05 DATA-DESO                    PIC X(10).                   00050001
           05 SALDO-DESO                   PIC S9(11)V99 COMP-3.        00060001
