       01  REG-EXTTDV24.                                                00020009
           05 B112DV24-CPF                 PIC X(11).                   00030009
           05 B112DV24-NOME                PIC X(16).                   00040009
           05 B112DV24-DATA                PIC X(10).                   00050009
           05 B112DV24-SALDO               PIC S9(11)V99 COMP-3.        00060009
