       01  REG-EXTTD025.                                                00020004
           05 B112D025-CPF                 PIC X(11).                   00030006
           05 B112D025-NOME                PIC X(16).                   00040006
           05 B112D025-DATA                PIC X(10).                   00050006
           05 B112D025-SALDO               PIC S9(11)V99 COMP-3.        00060006
