       01  REG-EXTTDV25.                                                00020008
           05 B112DV25-CPF                 PIC X(11).                   00030008
           05 B112DV25-NOME                PIC X(16).                   00040008
           05 B112DV25-DATA                PIC X(10).                   00050008
           05 B112DV25-SALDO               PIC S9(11)V99 COMP-3.        00060008
