       01  REG-EXTTD024.                                                00020003
           05 B112D024-CPF                 PIC X(11).                   00030006
           05 B112D024-NOME                PIC X(16).                   00040006
           05 B112D024-DATA                PIC X(10).                   00050006
           05 B112D024-SALDO               PIC S9(11)V99 COMP-3.        00060006
