       01  REG-INVE2025.                                                00020007
           05 CPF-INVE2025                 PIC X(11).                   00030007
           05 NOME-INVE2025                PIC X(16).                   00040007
           05 DATA-INVE2025                PIC X(10).                   00050007
           05 SALDO-INVE2025               PIC S9(11)V99 COMP-3.        00060007
           05 INVESTIMENTO                 PIC X(08).                   00061009
           05 TAXARETORNOPORANO            PIC S9(11)V99 COMP-3.        00070008
           05 VALORFINAL                   PIC S9(11)V99 COMP-3.        00080006
           05 LUCROESTIMADO                PIC S9(11)V99 COMP-3.        00090006
