       01  REG-EXTTA024.                                                00020008
           05 B112A024-CPF                 PIC X(11).                   00030008
           05 B112A024-NOME                PIC X(16).                   00040008
           05 B112A024-DATA                PIC X(10).                   00050008
           05 B112A024-SALDO               PIC S9(11)V99 COMP-3.        00060008
